
class Board:
    def __init__(self):
        self.board = self.create_board()
    
    # Создаем начальную расстановку фигур на доске
    def create_board(self):

        clean_board_3 = [
            ['  ', 'a ', 'b ', 'c ', 'd ', 'e ', 'f ', 'g ', 'h '],
            ['8 ', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', ' 8'],
            ['7 ', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', ' 7'],
            ['6 ', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', ' 6'],
            ['5 ', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', ' 5'],
            ['4 ', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', ' 4'],
            ['3 ', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', ' 3'],
            ['2 ', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', ' 2'],
            ['1 ', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', '⬛️', '⬜️', ' 1'],
            ['  ', 'a ', 'b ', 'c ', 'd ', 'e ', 'f ', 'g ', 'h '],
        ]

        

    # Отображаем доску
    def display(self):
        print("\n"*15)

        for i in self.board:
            print(*i, sep='')
        
        print("\n"*35)

    trans_alph_x = {
        'a': 1,
        'b': 2,
        'c': 3,
        'd': 4,
        'e': 5,
        'f': 6,
        'g': 7,
        'h': 8,
    }

    trans_alph_y = {
        '1': 8,
        '2': 7,
        '3': 6,
        '4': 5,
        '5': 4,
        '6': 3,
        '7': 2,
        '8': 1,
    }


    

# clean_board_1 = [
#         "◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️",
#         "◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️",
#         "◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️",
#         "◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️",
#         "◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️",
#         "◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️",
#         "◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️",
#         "◻️ ◼️ ◻️ ◼️ ◻️ ◼️ ◻️ ◼️",
#     ]

# clean_board_2 = [
#         "  a b c d e f g h",
#         "8 ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️ 8",
#         "7 ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️ 7",
#         "6 ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️ 6",
#         "5 ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️ 5",
#         "4 ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️ 4",
#         "3 ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️ 3",
#         "2 ⬜️⬛️⬜️⬛️⬜️⬛️⬜️⬛️ 2",
#         "1 ⬛️⬜️⬛️⬜️⬛️⬜️⬛️⬜️ 1",
#         "  a b c d e f g h",
#     ]
 